Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремени") Тогда
		Для Каждого ТекСтрокаТабель Из ДанныеЗаполнения.Табель Цикл
			НоваяСтрока = Зарплата.Добавить();
			НоваяСтрока.Должность = ТекСтрокаТабель.Должность;
			НоваяСтрока.ПочасоваяСтавка = ТекСтрокаТабель.Ставка;
			НоваяСтрока.Сотрудник = ТекСтрокаТабель.ФИО;
			НоваяСтрока.АвансВыработка = ТекСтрокаТабель.ИтогоПолмесяца;
			НоваяСтрока.ЗарплатаВыработка = ТекСтрокаТабель.ИтогоВтораяПоловина;
			НоваяСтрока = Удержания.Добавить();
			НоваяСтрока.Сотрудник = ТекСтрокаТабель.ФИО;
			КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеЗарплаты") Тогда
	КонецЕсли;
КонецПроцедуры