Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеЗарплаты") Тогда

		Месяц = ДанныеЗаполнения.МесяцНачисления;
		ВидВыплаты = ДанныеЗаполнения.ВидВыплаты;
		Для Каждого ТекСтрокаЗарплата Из ДанныеЗаполнения.Зарплата Цикл
			НоваяСтрока = ВыплатаЗарплаты.Добавить();
			НоваяСтрока.НДФЛ = ТекСтрокаЗарплата.НачисленоИтого * 13 / 100;
			НоваяСтрока.КОплате = ТекСтрокаЗарплата.НачисленоИтого - НоваяСтрока.НДФЛ;
			НоваяСтрока.Сотрудник = ТекСтрокаЗарплата.Сотрудник;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры