
&НаСервере
Функция ПолучитьВидВыплатыЗарплата()
    Возврат Перечисления.ВидВыплаты.Зарплата;
КонецФункции

&НаСервере
Функция ПолучитьВидВыплатыАванс()
    Возврат Перечисления.ВидВыплаты.Аванс;
КонецФункции

&НаКлиенте
Процедура ВидВыплатыПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Зарплата.ТекущиеДанные;
	Если Объект.ВидВыплаты = ПолучитьВидВыплатыАванс() Тогда
		Для Каждого СтрокаТЧ из Объект.Зарплата Цикл
			СтрокаТЧ.Выработка = СтрокаТЧ.АвансВыработка;
		КонецЦикла;
	ИначеЕсли Объект.ВидВыплаты =ПолучитьВидВыплатыЗарплата() Тогда
		Для Каждого СтрокаТЧ из Объект.Зарплата Цикл
			СтрокаТЧ.Выработка = СтрокаТЧ.ЗарплатаВыработка;
			КонецЦикла;
	КонецЕсли;
	РасчетНачисленоИтого(СтрокаТЧ);
	РасчитатьНачислено(СтрокаТЧ);
	ЗаполнениеТЧУдержания (СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура РасчетНачисленоИтого(СтрокаТЧ)
	Для Каждого СтрокаТЧ из Объект.Зарплата Цикл
		СтрокаТЧ.НачисленоИтого = СтрокаТЧ.Выработка * СтрокаТЧ.ПочасоваяСтавка;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьНачислено(СтрокаТЧ)
	Объект.Начислено = 0;
	Для Каждого СтрокаТЧ из Объект.Зарплата Цикл
		Объект.Начислено = Объект.Начислено + СтрокаТЧ.НачисленоИтого;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеТЧУдержания(СтрокаТЧ)
	СтрокаТЧУдержания = Элементы.Удержания1.ТекущаяСтрока;
	Для Каждого СтрокаТЧУдержания Из Объект.Удержания Цикл
		Для Каждого СтрокаТЧ из Объект.Зарплата Цикл
			СтрокаТЧУдержания.НДФЛ = СтрокаТЧ.НачисленоИтого * 13 / 100;
			СтрокаТЧУдержания.ПФР = СтрокаТЧ.НачисленоИтого * 22 / 100;
			СтрокаТЧУдержания.ФСС = СтрокаТЧ.НачисленоИтого * 2.9 / 100;
			СтрокаТЧУдержания.УдержаноИзЗП = СтрокаТЧУдержания.НДФЛ + СтрокаТЧУдержания.ПФР + СтрокаТЧУдержания.ФСС;  
		КонецЦикла;
	КонецЦикла;
	РасчитатьУдержано(СтрокаТЧУдержания);
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьУдержано(СтрокаТЧУдержания)
	Объект.Удержано = 0;
	Для Каждого СтрокаТЧУдержания из Объект.Удержания Цикл
		Объект.Удержано = Объект.Удержано + СтрокаТЧУдержания.УдержаноИзЗп;
	КонецЦикла;
КонецПроцедуры
